---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeOrTypeError
source: html/18bd4a61-4643-e9cb-51de-297b6c0597d0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeOrTypeError Property

Cannot create a DirectShape or DirectShapeType.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateDirectShapeOrTypeError { get; }
```